ERP.belugaerp/src/InformationRegisters/бг_ТранспортнаяИнформация/бг_ТранспортнаяИнформация.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>бг_ТранспортнаяИнформация</name>
  <resources>
    <name>Представление</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ПунктНазначения</name>
    <type>
      <types>CatalogRef.битПунктыНазначения</types>
    </type>
  </resources>
  <resources>
    <name>Водитель</name>
    <type>
      <types>String</types>
      <types>CatalogRef.ФизическиеЛица</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Перевозчик</name>
    <type>
      <types>CatalogRef.Организации</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </resources>
  <resources>
    <name>ДоговорНаПеревозку</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </resources>
  <resources>
    <name>ДоговорСубподряда</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </resources>
  <resources>
    <name>ЗначениеПоУмолчанию</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>Заказчик</name>
    <type>
      <types>CatalogRef.Организации</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </resources>
  <resources>
    <name>ВидПеревозки</name>
    <type>
      <types>CatalogRef.бг_ВидыПеревозки</types>
    </type>
  </resources>
  <resources>
    <name>ДоверенностьНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДоверенностьДата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДоверенностьЧерез</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>НомерЗаказа</name>
    <comment>Номер Заказа</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>НомераПломб</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ХранилищеДополнительныхСведений</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>ХранилищеСведенийТНиСВ</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>ДатаТН</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>НомерТН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Прицеп</name>
    <type>
      <types>CatalogRef.ТранспортныеСредства</types>
    </type>
  </resources>
  <resources>
    <name>ПорядковыйНомерТС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТипВладенияТС</name>
    <type>
      <types>CatalogRef.бг_ТипыВладенияТС</types>
    </type>
  </resources>
  <resources>
    <name>ОрганизаторПеревозки</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </resources>
  <resources>
    <name>ДоговорНаВладение</name>
    <type>
      <types>CatalogRef.бг_ДоговорыВладенияТС</types>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДоговорНаВладениеПрицеп</name>
    <type>
      <types>CatalogRef.бг_ДоговорыВладенияТС</types>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>МыГрузимТовар</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПлановаяДатаДоставкиС</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ПлановаяДатаДоставкиПо</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>РучнаяКорректировкаДатыДоставки</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>НомерКонтейнера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>DocumentRef.ПеремещениеТоваров</types>
      <types>DocumentRef.ЗаказКлиента</types>
      <types>DocumentRef.ВозвратТоваровПоставщику</types>
      <types>DocumentRef.ПриобретениеТоваровУслуг</types>
      <types>DocumentRef.ЗаказНаПеремещение</types>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
      <types>DocumentRef.ВозвратТоваровОтКлиента</types>
      <types>DocumentRef.ПередачаТоваровХранителю</types>
      <types>DocumentRef.ЗаказПоставщику</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТранспортноеСредство</name>
    <type>
      <types>CatalogRef.ТранспортныеСредства</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ERP.belugaerp/src/InformationRegisters/бг_ТранспортнаяИнформация/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

// Возвращает транспортную информацию по переданному документу.
//
// Параметры:
//  Объект  - Произвольный - объект, по которому хранится информация в регистре бг_ТранспортнаяИнформация.
//		Примечание: предполагается, что объектом будет являться ЗаказКлиента или РТУ.
//
// Возвращаемое значение:
//   Структура
//
Функция ТранспортнаяИнформация(Объект) Экспорт

	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	бг_ТранспортнаяИнформация.Объект КАК Объект,
	|	бг_ТранспортнаяИнформация.Объект.Номер КАК ОбъектНомер,
	|	бг_ТранспортнаяИнформация.Объект.Дата КАК ОбъектДата,
	|	бг_ТранспортнаяИнформация.ТранспортноеСредство КАК ТранспортноеСредство,
	|	бг_ТранспортнаяИнформация.ТранспортноеСредство.Представление КАК ТранспортноеСредствоПредставление,
	|	бг_ТранспортнаяИнформация.Представление КАК Представление,
	|	бг_ТранспортнаяИнформация.ПлановаяДатаДоставкиС КАК ПлановаяДатаДоставкиС,
	|	бг_ТранспортнаяИнформация.ПлановаяДатаДоставкиПо КАК ПлановаяДатаДоставкиПо,
	|	бг_ТранспортнаяИнформация.Водитель КАК Водитель,
	|	бг_ТранспортнаяИнформация.Перевозчик КАК Перевозчик,
	|	бг_ТранспортнаяИнформация.ЗначениеПоУмолчанию КАК ЗначениеПоУмолчанию,
	|	бг_ТранспортнаяИнформация.Комментарий КАК Комментарий,
	|	бг_ТранспортнаяИнформация.Заказчик КАК Заказчик,
	|	бг_ТранспортнаяИнформация.ВидПеревозки КАК ВидПеревозки,
	|	бг_ТранспортнаяИнформация.ДоверенностьНомер КАК ДоверенностьНомер,
	|	бг_ТранспортнаяИнформация.ДоверенностьДата КАК ДоверенностьДата,
	|	бг_ТранспортнаяИнформация.ДоверенностьЧерез КАК ДоверенностьЧерез,
	|	бг_ТранспортнаяИнформация.НомерЗаказа КАК НомерЗаказа,
	|	бг_ТранспортнаяИнформация.НомераПломб КАК НомераПломб,
	|	бг_ТранспортнаяИнформация.ХранилищеДополнительныхСведений КАК ХранилищеДополнительныхСведений,
	|	бг_ТранспортнаяИнформация.ХранилищеСведенийТНиСВ КАК ХранилищеСведенийТНиСВ,
	|	бг_ТранспортнаяИнформация.ДатаТН КАК ДатаТН,
	|	бг_ТранспортнаяИнформация.НомерТН КАК НомерТН,
	|	бг_ТранспортнаяИнформация.Прицеп КАК Прицеп,
	|	бг_ТранспортнаяИнформация.ПорядковыйНомерТС КАК ПорядковыйНомерТС,
	|	бг_ТранспортнаяИнформация.ТипВладенияТС КАК ТипВладенияТС,
	|	бг_ТранспортнаяИнформация.ПунктНазначения КАК ПунктНазначения,
	|	бг_ТранспортнаяИнформация.МыГрузимТовар КАК МыГрузимТовар,
	|	бг_ТранспортнаяИнформация.ДоговорНаВладение КАК ДоговорНаВладение,
	|	бг_ТранспортнаяИнформация.ДоговорНаПеревозку КАК ДоговорНаПеревозку,
	|	бг_ТранспортнаяИнформация.ДоговорСубподряда КАК ДоговорСубподряда,
	|	бг_ТранспортнаяИнформация.ОрганизаторПеревозки КАК ОрганизаторПеревозки
	|ИЗ
	|	РегистрСведений.бг_ТранспортнаяИнформация КАК бг_ТранспортнаяИнформация
	|ГДЕ
	|	бг_ТранспортнаяИнформация.Объект = &Объект";
	
	Запрос.УстановитьПараметр("Объект", Объект);
	
	ТаблицаТранспортнойИнформации = Запрос.Выполнить().Выгрузить();
	
	// Предполагаем, что по документу может быть только одна запись с одним ТС до выяснения обратного.
	Если ТаблицаТранспортнойИнформации.Количество() > 0 Тогда
		Возврат ОбщегоНазначения.ТаблицаЗначенийВМассив(ТаблицаТранспортнойИнформации)[0];
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

// Возвращает транспортную информацию по переданному массиву документов.
//
// Параметры:
//  Объект  - Массив - Произвольный - массив объектов, по которым хранится информация в регистре бг_ТранспортнаяИнформация.
//
// Возвращаемое значение:
//   ТаблицаЗначений - транспортная информация по объектам
//
Функция ТранспортнаяИнформацияОбъектов(Объекты) Экспорт

	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ 
	|	бг_ТранспортнаяИнформация.Объект КАК Объект,
	|	бг_ТранспортнаяИнформация.Объект.Номер КАК ОбъектНомер,
	|	бг_ТранспортнаяИнформация.Объект.Дата КАК ОбъектДата,
	|	бг_ТранспортнаяИнформация.ТранспортноеСредство КАК ТранспортноеСредство,
	|	бг_ТранспортнаяИнформация.ТранспортноеСредство.Представление КАК ТранспортноеСредствоПредставление,
	|	бг_ТранспортнаяИнформация.Представление КАК Представление,
	|	бг_ТранспортнаяИнформация.ПлановаяДатаДоставкиС КАК ПлановаяДатаДоставкиС,
	|	бг_ТранспортнаяИнформация.ПлановаяДатаДоставкиПо КАК ПлановаяДатаДоставкиПо,
	|	бг_ТранспортнаяИнформация.Водитель КАК Водитель,
	|	бг_ТранспортнаяИнформация.Перевозчик КАК Перевозчик,
	|	бг_ТранспортнаяИнформация.ЗначениеПоУмолчанию КАК ЗначениеПоУмолчанию,
	|	бг_ТранспортнаяИнформация.Комментарий КАК Комментарий,
	|	бг_ТранспортнаяИнформация.Заказчик КАК Заказчик,
	|	бг_ТранспортнаяИнформация.ВидПеревозки КАК ВидПеревозки,
	|	бг_ТранспортнаяИнформация.ДоверенностьНомер КАК ДоверенностьНомер,
	|	бг_ТранспортнаяИнформация.ДоверенностьДата КАК ДоверенностьДата,
	|	бг_ТранспортнаяИнформация.ДоверенностьЧерез КАК ДоверенностьЧерез,
	|	бг_ТранспортнаяИнформация.НомерЗаказа КАК НомерЗаказа,
	|	бг_ТранспортнаяИнформация.НомераПломб КАК НомераПломб,
	|	бг_ТранспортнаяИнформация.ХранилищеДополнительныхСведений КАК ХранилищеДополнительныхСведений,
	|	бг_ТранспортнаяИнформация.ХранилищеСведенийТНиСВ КАК ХранилищеСведенийТНиСВ,
	|	бг_ТранспортнаяИнформация.ДатаТН КАК ДатаТН,
	|	бг_ТранспортнаяИнформация.НомерТН КАК НомерТН,
	|	бг_ТранспортнаяИнформация.Прицеп КАК Прицеп,
	|	бг_ТранспортнаяИнформация.ПорядковыйНомерТС КАК ПорядковыйНомерТС,
	|	бг_ТранспортнаяИнформация.ТипВладенияТС КАК ТипВладенияТС,
	|	бг_ТранспортнаяИнформация.ПунктНазначения КАК ПунктНазначения,
	|	бг_ТранспортнаяИнформация.МыГрузимТовар КАК МыГрузимТовар,
	|	бг_ТранспортнаяИнформация.ДоговорНаВладение КАК ДоговорНаВладение,
	|	бг_ТранспортнаяИнформация.ОрганизаторПеревозки КАК ОрганизаторПеревозки
	|ИЗ
	|	РегистрСведений.бг_ТранспортнаяИнформация КАК бг_ТранспортнаяИнформация
	|ГДЕ
	|	бг_ТранспортнаяИнформация.Объект В(&Объекты)";
	
	Запрос.УстановитьПараметр("Объекты", Объекты);
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Возврат Результат;
	
КонецФункции

// Возвращает структуру параметров для первоначального заполнения записи транспортной информации
// 
// Возвращаемое значение:
//   Структура - структура для первоначального заполнения записи транспортной информации, 
//   			ключи структуры равны значениям ресурсов регистра ТИ.
Функция ПараметрыЗаполненияТранспортнойИнформации() Экспорт             
	УстановитьПривилегированныйРежим(Истина);
	Результат = Новый Структура;
	Для каждого Ресурс Из Метаданные.РегистрыСведений.бг_ТранспортнаяИнформация.Ресурсы Цикл
		Результат.Вставить(Ресурс.Имя);
	КонецЦикла;                          
	Возврат Результат;
КонецФункции

// Записывает в регистр сведений, транспортную информацию объекта по заказу клиента
// Примечание: предполагается, что объектом будет являться РТиУ.
// 
// Параметры:
//   Объект  - Ссылка - объект,
//	 по которому необходимо внести информацию в регистр бг_ТранспортнаяИнформация.
//
Процедура ДобавитьОбъект(Объект, ЗаказКлиента) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ТекущаяТранспортнаяИнформация = ТранспортнаяИнформация(Объект);
	
	Если ЗначениеЗаполнено(ТекущаяТранспортнаяИнформация) Тогда
		Возврат;
	КонецЕсли;
	
	ТранспортнаяИнформацияПоЗаказуКлиента = ТранспортнаяИнформация(ЗаказКлиента);
	
	Если ЗначениеЗаполнено(ТранспортнаяИнформацияПоЗаказуКлиента) Тогда
		
		НоваяЗапись = РегистрыСведений.бг_ТранспортнаяИнформация.СоздатьМенеджерЗаписи(); 	
		ЗаполнитьЗначенияСвойств(НоваяЗапись, ТранспортнаяИнформацияПоЗаказуКлиента);		
		НоваяЗапись.Объект = Объект;		
		НоваяЗапись.Записать();
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
